<template>
  <div class="pa-10">
    <v-sheet
      class="pa-8"
      rounded="lg"
      min-height="10"
    >
      <h1>利用規約</h1><br />
      <p>この利用規約（以下，「本規約」といいます。）は，モナレッジ（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。</p>
      <br />

      <h2>第1条（適用）</h2>
      <p>1. 本規約は，ユーザーと本サービスの利用に関わる一切の関係に適用されるものとします。</p>
      <p>2. 本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。</p>
      <p>3. 本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。</p>

      <h2>第2条（利用登録）</h2>
      <p>1. 本サービスにおいては，登録希望者が本規約に同意の上，利用登録を申請し，利用登録が完了するものとします。また、本サービスの一部機能に関しては利用登録することなく利用可能なものも存在する</p>

      <h2>第3条（秘密鍵の管理）</h2>
      <p>1. ユーザーは，自己の責任において，秘密鍵を適切に管理するものとします。当サービスにおいて、当サービスの機能としてユーザの秘密鍵の登録、発行、保存は必要ありません</p>
      <p>2. 秘密鍵が第三者によって使用されたことによって生じた損害は，当社は一切の責任を負わないものとします。</p>

      <h2>第4条（禁止事項）</h2>
      <p>ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。</p>
      <p>1. 法令または公序良俗に違反する行為</p>
      <p>2. 犯罪行為に関連する行為</p>
      <p>3. 本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為</p>
      <p>4. 当社，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為</p>
      <p>5, 当社のサービスの運営を妨害するおそれのある行為</p>
      <p>6. 不正アクセスをし，またはこれを試みる行為</p>
      <p>7. 不正な目的を持って本サービスを利用する行為</p>
      <p>8. 本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為</p>
      <p>9. 他のユーザーに成りすます行為</p>
      <p>10. 当社のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</p>
      <p>11. その他，当社が不適切と判断する行為</p>

      <h2>第5条（本サービスの提供の停止等）</h2>
      <p>以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。</p>
      <p>1. 本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</p>
      <p>2. 地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合</p>
      <p>3. コンピュータまたは通信回線等が事故により停止した場合</p>
      <p>4. その他，本サービスの提供が困難と判断した場合</p>
      <p>本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします</p>

      <h2>第6条（利用制限および登録抹消）</h2>
      <p>ユーザーが以下のいずれかに該当する場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。</p>
      <p>1. 本規約のいずれかの条項に違反した場合</p>
      <p>2. 登録事項に虚偽の事実があることが判明した場合</p>
      <p>3. 当社からの連絡に対し，一定期間返答がない場合</p>
      <p>4, その他，当社が本サービスの利用を適当でないと判断した場合</p>
      <p>本条に基づき当社が行った行為によりユーザーに生じた損害について，一切の責任を負いません。</p>

      <h2>第7条（保証の否認および免責事項）</h2>
      <p>1. 本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</p>
      <p>2. 本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし，本サービスに関するユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。</p>
      <p>3. 当社は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。</p>

      <h2>第8条（サービス内容の変更等）</h2>
      <p>ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。</p>


      <h2>第9条（利用規約の変更）</h2>
      <p>必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該ユーザーは変更後の規約に同意したものとみなします。</p>

      <h2>第10条（準拠法・裁判管轄）</h2>
      <p>1. 本規約の解釈にあたっては，日本法を準拠法とします。</p>
      <p>2. 本サービスに関して紛争が生じた場合には，当社の本店所在地を管轄する裁判所を専属的合意管轄とします。</p>

    </v-sheet>
  </div>
</template>
